Aloxaf/fzf-tab
ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/fancy-ctrl-z
jeffreytse/zsh-vi-mode
hlissner/zsh-autopair
zsh-users/zsh-completions
MichaelAquilina/zsh-you-should-use
zdharma-continuum/fast-syntax-highlighting
